# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [120]:
import pandas as pd
import numpy as np


data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [103]:
#計算每個不同種類 animal 的 age 的平均數

df.groupby(['animal'])['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [104]:
#將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序


df.sort_values(by=['age','visits'], ascending=False)

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
b    cat  3.0       3      yes
j    dog  3.0       1       no
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [105]:
#將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False

df['priority'][df.priority=='yes']='True'
df['priority'][df.priority=='no']='False'

df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [115]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.100732  0.730027  0.850287
1  0.104092  0.449337  0.651799
2  0.018624  0.149158  0.308354
3  0.153237  0.697381  0.944892
4  0.995191  0.698371  0.755768

In [116]:
print(df.mean())

df= df-df.mean(axis=0)
df

0    0.274375
1    0.544855
2    0.702220
dtype: float64

          0         1         2
0 -0.173643  0.185172  0.148067
1 -0.170283 -0.095518 -0.050421
2 -0.255751 -0.395697 -0.393866
3 -0.121138  0.152526  0.242672
4  0.720816  0.153516  0.053548

In [117]:
df.sub(df.mean(axis=1),axis=0)
df

          0         1         2
0 -0.173643  0.185172  0.148067
1 -0.170283 -0.095518 -0.050421
2 -0.255751 -0.395697 -0.393866
3 -0.121138  0.152526  0.242672
4  0.720816  0.153516  0.053548

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [118]:
df

          0         1         2
0 -0.173643  0.185172  0.148067
1 -0.170283 -0.095518 -0.050421
2 -0.255751 -0.395697 -0.393866
3 -0.121138  0.152526  0.242672
4  0.720816  0.153516  0.053548

In [119]:
df.sum(axis=0).argmax()

2

In [114]:
df.sum(axis=1).argmax()

4